Repository: fwhthijssen-wq/life_legacy_manager
Catalog: lib/l10n/app_*.arb
Languages: nl

# appSubtitle
source: Your personal life compass
nl: Uw persoonlijke levenscompas

source: Welcome
nl: Welkom

# accountCreate
source: Create Account
nl: Account Aanmaken

source: Login
nl: Inloggen

source: Logout
nl: Uitloggen

source: Cancel
nl: Annuleren

source: Save
nl: Opslaan

source: Delete
nl: Verwijderen

source: Edit
nl: Bewerken

source: Back
nl: Terug

source: Next
nl: Volgende

source: Skip
nl: Overslaan

source: Done
nl: Klaar

source: Close
nl: Sluiten

source: Confirm
nl: Bevestigen

source: Create
nl: Aanmaken

source: Update
nl: Bijwerken

source: Add
nl: Toevoegen

source: Remove
nl: Verwijderen

# continueButton
source: Continue
nl: Doorgaan

source: Yes
nl: Ja

source: No
nl: Nee

# email
source: Email Address
nl: E-mailadres

source: Password
nl: Wachtwoord

source: Confirm Password
nl: Herhaal wachtwoord

source: First Name
nl: Voornaam

source: Last Name
nl: Achternaam

# namePrefix
source: Prefix
nl: Tussenvoegsel

# birthDate
source: Date of Birth
nl: Geboortedatum

source: Gender
nl: Geslacht

# phone
source: Phone Number
nl: Telefoonnummer

source: Address
nl: Adres

source: Postal Code
nl: Postcode

source: City
nl: Plaats

source: Description
nl: Omschrijving

source: Name
nl: Naam

# genderMale
source: Male
nl: Man

# genderFemale
source: Female
nl: Vrouw

# genderOther
source: Other
nl: Anders

# genderUnknown
source: Unknown
nl: Onbekend

# genderNonBinary
source: Non-binary
nl: Non-binair

# welcomeIntroTitle
source: Welcome
nl: Welkom

# welcomeIntroText
source: Throughout life we collect important documents, contracts, and information. From bank accounts to insurance policies, from energy contracts to personal wishes. But where do you keep all this? And what if your loved ones need this information?
nl: In het leven verzamelen we belangrijke documenten, contracten, en informatie. Van bankrekeningen tot verzekeringen, van energiecontracten tot persoonlijke wensen. Maar waar bewaar je dit allemaal? En wat als je nabestaanden deze informatie nodig hebben?

# welcomeIntroText2
source: Life & Legacy Manager is your personal life compass. A safe, organized place where you collect, manage and make accessible all important information for yourself and your loved ones.
nl: Life & Legacy Manager is uw persoonlijke levenscompas. Een veilige, overzichtelijke plek waar u alle belangrijke informatie verzamelt, beheert en toegankelijk maakt voor uzelf en uw naasten.

# welcomeWhatToExpect
source: What can you expect?
nl: Wat kunt u verwachten?

# welcomeFooter1
source: Start organizing your life information today
nl: Begin vandaag met het organiseren van uw levensinformatie

# welcomeFooter2
source: Peace of mind for you and your loved ones
nl: Rust en zekerheid voor u en uw naasten

# featurePrivacyTitle
source: Completely Private
nl: Volledig Privé

# featurePrivacyDesc
source: All your data is stored locally on your device
nl: Al uw gegevens blijven lokaal op uw apparaat opgeslagen

# featureOverviewTitle
source: Well Organized
nl: Overzichtelijk

# featureOverviewDesc
source: Structured by theme: finances, home, legal, and more
nl: Gestructureerd per thema: geldzaken, huis, juridisch, en meer

# featureFamilyTitle
source: For Your Loved Ones
nl: Voor Nabestaanden

# featureFamilyDesc
source: Everything they need to know, in one accessible place
nl: Alles wat ze moeten weten, op één plek toegankelijk

# featureDocumentsTitle
source: Document Management
nl: Documentbeheer

# featureDocumentsDesc
source: Add documents or note where they are stored
nl: Voeg documenten toe of noteer waar ze bewaard zijn

# featureProgressTitle
source: Track Progress
nl: Voortgang Bijhouden

# featureProgressDesc
source: See at a glance which sections are complete
nl: Zie in één oogopslag welke onderdelen compleet zijn

# featureSecurityTitle
source: Securely Stored
nl: Veilig Bewaard

# featureSecurityDesc
source: Protected with password, PIN code or biometrics
nl: Beveiligd met wachtwoord, pincode of biometrie

# registerTitle
source: Create Account
nl: Account aanmaken

# registerButton
source: Create Account
nl: Account aanmaken

# registerSelectDate
source: Select date
nl: Selecteer datum

# registerDateFormat
source: {month}/{day}/{year}
nl: {day}-{month}-{year}

# registerSuccess
source: Account created successfully
nl: Account succesvol aangemaakt

# registerFailed
source: Registration failed
nl: Registratie mislukt

# registerSelectBirthDate
source: Select a birth date
nl: Selecteer een geboortedatum

# loginTitle
source: Login
nl: Inloggen

# loginButton
source: Login
nl: Inloggen

# loginForgotPassword
source: Forgot password?
nl: Wachtwoord vergeten?

# loginNoAccount
source: Don't have an account?
nl: Nog geen account?

# loginFailed
source: Login failed. Please check your credentials.
nl: Inloggen mislukt. Controleer uw gegevens.

# pinSetupTitle
source: Quick Login
nl: Snel Inloggen

# pinSetupSubtitle
source: Set up a PIN code to quickly and easily log in without typing your full password.
nl: Stel een pincode in om voortaan snel en gemakkelijk in te loggen zonder uw volledige wachtwoord te typen.

# pinChooseTitle
source: Choose your PIN
nl: Kies uw pincode

# pinChooseSubtitle
source: 4 to 8 digits
nl: 4 tot 8 cijfers

# pinNew
source: New PIN
nl: Nieuwe PIN

# pinNewHint
source: Enter 4-8 digits
nl: Voer 4-8 cijfers in

# pinConfirm
source: Confirm PIN
nl: Herhaal PIN

# pinConfirmHint
source: Enter the same PIN again
nl: Voer dezelfde PIN nogmaals in

# pinSetup
source: Set Up PIN
nl: PIN Instellen

# pinSetupInProgress
source: Saving...
nl: Bezig met opslaan...

# pinSkipLater
source: Not now, set up later
nl: Nu niet, later instellen

# pinSkipTitle
source: Skip PIN
nl: PIN overslaan

# pinSkipMessage
source: Are you sure you don't want to set up a PIN? You can still do this later via settings. Without a PIN you'll need to enter your full password each time.
nl: Weet u zeker dat u geen PIN wilt instellen? U kunt dit later alsnog doen via instellingen. Zonder PIN moet u steeds uw volledige wachtwoord invoeren.

# pinTipsTitle
source: Tips for a secure PIN
nl: Tips voor een veilige PIN

# pinTip1
source: Don't use obvious numbers like 1234 or your birth year
nl: Gebruik geen voor de hand liggende cijfers zoals 1234 of uw geboortejaar

# pinTip2
source: Don't share your PIN with others
nl: Vertel uw PIN niet aan anderen

# pinTip3
source: You can change your PIN later in settings
nl: U kunt de PIN later wijzigen via instellingen

# pinBiometricAvailable
source: Biometric security available! After setting up your PIN you can also activate fingerprint/face recognition.
nl: Biometrische beveiliging beschikbaar! Na het instellen van de PIN kunt u ook vingerafdruk/gezichtsherkenning activeren.

# pinBiometricTitle
source: Biometric Security
nl: Biometrische beveiliging

# pinBiometricMessage
source: Your device supports fingerprint or face recognition. Would you like to activate this for quick access?
nl: Uw apparaat ondersteunt vingerafdruk of gezichtsherkenning. Wilt u dit ook activeren voor snelle toegang?

# pinBiometricNotNow
source: Not now
nl: Nu niet

# pinBiometricActivate
source: Activate
nl: Activeren

# unlockTitle
source: Welcome back
nl: Welkom terug

# unlockSubtitle
source: Enter your PIN code to continue
nl: Voer uw pincode in om door te gaan

# unlockPinHint
source: Enter your PIN
nl: Voer uw PIN in

# unlockButton
source: Unlock
nl: Ontgrendelen

# unlockInProgress
source: Unlocking...
nl: Bezig...

# unlockBiometric
source: Unlock with Biometrics
nl: Biometrisch Ontgrendelen

# unlockWithPassword
source: Login with password
nl: Inloggen met wachtwoord

# unlockError
source: Incorrect PIN. Please try again.
nl: Onjuiste PIN. Probeer opnieuw.

# unlockBiometricFailed
source: Biometric authentication failed
nl: Biometrische authenticatie mislukt

# unlockBiometricUnavailable
source: Biometrics not available
nl: Biometrie niet beschikbaar

# unlockInfoMessage
source: Your data is safely stored on this device
nl: Uw gegevens zijn veilig opgeslagen op dit apparaat

# recoveryPhraseTitle
source: Save Recovery Phrase
nl: Herstelzinnen Bewaren

# recoveryPhraseSubtitle
source: Write down these 12 words and keep them in a safe place
nl: Schrijf deze 12 woorden op en bewaar ze op een veilige plek

# recoveryPhraseWarning
source: IMPORTANT: If you forget your password, these words are the ONLY way to restore access.
nl: BELANGRIJK: Als u uw wachtwoord vergeet, zijn deze woorden de ENIGE manier om toegang te herstellen.

# recoveryPhraseInstructions
source: 1. Write down all 12 words in the correct order 2. Keep them in a safe place (not digitally!) 3. Don't tell anyone these words 4. You'll need them to recover your password
nl: 1. Schrijf alle 12 woorden op in de juiste volgorde 2. Bewaar ze op een veilige plek (niet digitaal!) 3. Vertel niemand deze woorden 4. U hebt ze nodig om uw wachtwoord te herstellen

# recoveryPhraseCopyWarning
source: Do NOT copy these words to your clipboard or a digital document
nl: Kopieer deze woorden NIET naar uw klembord of een digitaal document

# recoveryPhraseConfirmTitle
source: Confirm Recovery Phrase
nl: Bevestig Herstelzinnen

# recoveryPhraseConfirmSubtitle
source: Enter the words to confirm you've written them down
nl: Voer de woorden in om te bevestigen dat u ze hebt opgeschreven

# recoveryPhraseConfirmInstructions
source: Enter word {number}:
nl: Voer woord {number} in:

# recoveryPhraseConfirmError
source: Incorrect word. Check your notes and try again.
nl: Onjuist woord. Controleer uw notities en probeer opnieuw.

# recoveryPhraseConfirmed
source: Recovery phrase confirmed! Your account is now secured.
nl: Herstelzinnen bevestigd! Uw account is nu beveiligd.

# recoveryPhraseIWroteItDown
source: I've written down the words
nl: Ik heb de woorden opgeschreven

# recoveryPhraseShowAgain
source: Show again
nl: Toon opnieuw

# recoveryPhraseWord
source: Word {number}
nl: Woord {number}

# passwordRecoveryTitle
source: Recover Password
nl: Wachtwoord Herstellen

# passwordRecoverySubtitle
source: Enter your 12-word recovery phrase
nl: Voer uw 12-woorden herstelzinnen in

# passwordRecoveryInstructions
source: Enter all 12 words in the correct order to recover your password.
nl: Voer alle 12 woorden in de juiste volgorde in om uw wachtwoord te herstellen.

# passwordRecoveryEnterWords
source: Enter recovery phrase
nl: Voer herstelzinnen in

# passwordRecoveryWordsHint
source: word1 word2 word3 ...
nl: woord1 woord2 woord3 ...

# passwordRecoveryNewPassword
source: New password
nl: Nieuw wachtwoord

# passwordRecoveryConfirmPassword
source: Confirm new password
nl: Bevestig nieuw wachtwoord

# passwordRecoveryRecover
source: Recover Password
nl: Herstel Wachtwoord

# passwordRecoverySuccess
source: Password recovered successfully!
nl: Wachtwoord succesvol hersteld!

# passwordRecoveryFailed
source: Recovery phrase incorrect. Please try again.
nl: Herstelzinnen onjuist. Probeer opnieuw.

# passwordRecoveryNoPhrase
source: No recovery phrase set
nl: Geen herstelzinnen ingesteld

# passwordRecoveryNoAccess
source: Without a recovery phrase you cannot recover your password. Please contact support.
nl: Zonder herstelzinnen kunt u uw wachtwoord niet herstellen. Neem contact op met support.

# dossierSelect
source: Select Dossier
nl: Selecteer Dossier

# dossierSelectSubtitle
source: Choose which dossier to manage
nl: Kies welk dossier u wilt beheren

# dossierCreate
source: New Dossier
nl: Nieuw Dossier

# dossierCreateTitle
source: Create Dossier
nl: Dossier Aanmaken

# dossierEditTitle
source: Edit Dossier
nl: Dossier Bewerken

source: Dossier Name
nl: Dossiernaam

# dossierNameHint
source: e.g. My Family, Parents, etc.
nl: bijv. Mijn Gezin, Ouders, etc.

# dossierDescription
source: Description (optional)
nl: Omschrijving (optioneel)

# dossierDescriptionHint
source: What is this dossier about?
nl: Waar gaat dit dossier over?

# dossierIcon
source: Icon
nl: Icoon

# dossierColor
source: Color
nl: Kleur

# dossierPersonCount
source: {count} persons
nl: {count} personen

# dossierCreatedAt
source: Created on {date}
nl: Aangemaakt op {date}

# dossierDeleteTitle
source: Delete Dossier?
nl: Dossier Verwijderen?

# dossierDeleteMessage
source: Are you sure you want to delete this dossier? All persons and data in this dossier will be permanently deleted.
nl: Weet u zeker dat u dit dossier wilt verwijderen? Alle personen en gegevens in dit dossier worden permanent verwijderd.

# dossierDeleteConfirm
source: Yes, Delete
nl: Ja, Verwijderen

# dossierDeleteCancel
source: Cancel
nl: Annuleren

source: Dossier deleted
nl: Dossier verwijderd

source: Dossier saved
nl: Dossier opgeslagen

# dossierNoDossiers
source: No dossiers yet
nl: Nog geen dossiers

# dossierCreateFirst
source: Create your first dossier to get started
nl: Maak uw eerste dossier aan om te beginnen

# dossierActive
source: Active
nl: Actief

# dossierInactive
source: Inactive
nl: Inactief

# dossierManage
source: Manage Dossiers
nl: Dossiers Beheren

# splashSubtitle
source: Your personal life compass
nl: Uw persoonlijke levenscompas

# splashLoading
source: Please wait...
nl: Even geduld...

# loading
source: Please wait...
nl: Even geduld...

# error
source: Something went wrong
nl: Er ging iets mis

source: Success!
nl: Gelukt!

# validationRequired
source: This field is required
nl: Dit veld is verplicht

# validationEmail
source: Invalid email address
nl: Ongeldig e-mailadres

# validationPasswordLength
source: Password must be at least 6 characters
nl: Wachtwoord moet minimaal 6 tekens zijn

# validationPasswordMatch
source: Passwords do not match
nl: Wachtwoorden komen niet overeen

# validationPinLength
source: PIN must be at least 4 digits
nl: PIN moet minimaal 4 cijfers zijn

# validationPinMax
source: PIN can be maximum 8 digits
nl: PIN mag maximaal 8 cijfers zijn

# validationPinMatch
source: PINs do not match
nl: PIN's komen niet overeen

# validationPinEmpty
source: Enter a PIN
nl: Vul een PIN in

# validationNameMin
source: {field} must be at least 2 characters
nl: {field} moet minimaal 2 tekens bevatten

# validationNameRequired
source: Enter {field}
nl: Vul {field} in

# personEdit
source: Edit Person
nl: Persoon bewerken

# personAdd
source: Add Person
nl: Persoon toevoegen

source: Person not found
nl: Persoon niet gevonden

# personSaveChanges
source: Save Changes
nl: Wijzigingen opslaan

# personRelationToUser
source: Relationship to user
nl: Relatie tot gebruiker

# personRelationSelf
source: Myself
nl: Ikzelf

# personRelationChild
source: Child
nl: Kind

# personRelationParent
source: Parent
nl: Ouder

# personRelationFamily
source: Family
nl: Familie

# personRelationFriend
source: Friend
nl: Vriend(in)

# personRelationOther
source: Other
nl: Overig

# personDeathDate
source: Date of death (optional)
nl: Overlijdensdatum (optioneel)

# personNotes
source: Comments / notes
nl: Opmerkingen / notities

# personSelectDate
source: Click to select date
nl: Klik om datum te kiezen

# personChooseRelation
source: Choose a relationship
nl: Kies een relatie

# personPhoneShort
source: Phone number seems too short
nl: Telefoonnummer lijkt te kort

# personPhoneInvalid
source: Invalid phone number
nl: Ongeldig telefoonnummer

# personPostalInvalid
source: Postal code must be like 1234 AB
nl: Postcode moet zijn als 1234 AB

# personManage
source: Manage Persons
nl: Personen Beheren

# personNoPersons
source: No persons in this dossier yet
nl: Nog geen personen in dit dossier

# personAddFirst
source: Add the first person
nl: Voeg de eerste persoon toe

source: Person deleted
nl: Persoon verwijderd

source: Person saved
nl: Persoon opgeslagen

# personDeleteTitle
source: Delete Person?
nl: Persoon Verwijderen?

# personDeleteMessage
source: Are you sure you want to delete {name}?
nl: Weet u zeker dat u {name} wilt verwijderen?

# personAge
source: {age} years
nl: {age} jaar

# personYearsOld
source: {years} years old
nl: {years} jaar
